package study.day21;

/**
 中国的高铁四通八达，乘坐方便，小明经常乘坐高铁在城市间旅游。
 现在，小明又有了一个长假，他打算继续乘坐高铁旅游。这次，他打算到
 下面的城市旅游。
 上海、广州、长沙、西安、杭州、济南、成都、南京、昆明、郑州、天津、
 太原、武汉、重庆、南昌、长春、沈阳、贵阳、福州。
 小明打算从北京出发，游览以上每个城市正好一次，最终回到北京。在每
 个城市（除北京外），小明都至少停留 24 小时。而当小明决定从一个城市去往
 另一个城市时，他只会选择有直接高铁连接的城市，不会在中途换乘转车。
 在试题目录下有一个文件 trip.txt 保存了小明可以选择的车次，小明不会
 选择其他车次。
 小明出发的时间是第 1 天的中午 12:00。请问，小明游览完以上城市正好一
 次，最终回到北京，最快需要多少分钟（请注意单位为分钟，请注意除北京外
 的城市需要至少停留 24 小时，即最少停留 1440 分钟）。
 车次    出发地   目的地  发车     到达    乘车时间/分钟 
 G8901    北京    天津    22:10    22:45     35
 G2609    天津    太原    10:40    14:15    215
 G688      太原    郑州    17:38    21:38    240
 G2001    郑州    西安     7:52     10:24    152
 G2231    西安    重庆    17:6      22:56    350
 G8594    重庆    成都     6:50      8:7        77
 G2883    成都    昆明     8:51     14:29    338
 G1514    昆明    南昌     16:0     22:54    414
 G5314    南昌    福州     8:13     11:9      176
 G1636    福州    上海    12:26    16:55    269
 G7355    上海    杭州    21:30    22:28     58
 G7604    杭州    南京    12:9      13:30     81
 G579      南京    长沙    9:27      14:10    283
 G6117    长沙    广州    17:55     20:39   164
 G2960    广州    贵阳     7:27     13:43    376
 G1524    贵阳    武汉    14:23    19:33    310
 G1274    武汉    沈阳     7:23     19:3      700
 G8033    沈阳    长春     6:42      8:40     118
 G1242    长春    济南    15:33    22:35    422
 G336      济南    北京     7:45      9:33     108
 */
public class 最优旅行 {
    public static void main(String[] args) {

    }
}
